import jsImage from "../images/js.webp";
import phpImage from "../images/php.webp";
import laravelImage from "../images/laravel.webp";
import nodeImage from "../images/node.webp";
import telbotImage from "../images/telbot.webp";
import algoImage from "../images/algo.webp";
import dockerImage from "../images/docker.webp";
import graphImage from "../images/graph.webp";

const DummyCourses = [
  {
    id: "c1",
    image: phpImage,
    title: " آموزش جامع api نویسی با PHP",
    desc: "  API یکی از پر کاربردترین اجزای نرم افزاریه که حتما باید بلد باشی! توی این دوره قراره  نویسی رو…",
    teacher: "معین باغشیخی",
    rate: 4.2,
    price: 950000,
    numberStd: 44,
  },
  {
    id: "c2",
    image: jsImage,
    title: "پروژه های تخصصی با جاوا اسکریپت برای بازار کار",
    desc: " هیچ فرقی نمیکنه شما با چه کتابخونه یا فریمورکی کار میکنین. تو این دوره یاد میگیری به عنوان یه برنامه نویس فرانت‌اند چطور یه پروژه بزرگ و واقعی رو منیج کنی. حالا این پروژه میتونه با ویو، ری‌اکت یا حتی جاوا اسکریپت خام باشه.",
    teacher: "محمدامین سعیدی راد",
    rate: 4,
    price: 945000,
    numberStd: 1301,
  },
  {
    id: "c3",
    image: laravelImage,
    title: "144 تابع کالکشن در Laravel ",
    desc: "کالکشن ها در لاراول به شما این امکان را میدهند که تمام نیاز های خود را هنگام کار با آرایه های PHP پوشش دهید و با نوشتنِ کدِ کمتر، در شرایط پایدار تر و با خوانایی بیشتری به نتیجه دلخواه برسید",
    teacher: "آرمین هوشمند",
    rate: 4.3,
    price: 770000,
    numberStd: 5323,
  },
  {
    id: "c4",
    image: nodeImage,
    title: "آموزش حرفه ای NodeJS بدون پیش نیاز",
    desc: "الان و امروز کمتر کسی هست که از بازار کار داغ نود جی اس با خبر نباشه و یکی از دلایل استفاده از این تکنولوژی فارغ از یه خیلی از مزایاش برای برنامه نویسا(کسب و کار ها به کنار) همین بازار کارشه و ما توی این دوره از نقطه منفی صفر حتی اگه جاوااسکریپت بلد ",
    teacher: "محمدامین سعیدی راد ",
    rate: 4.5,
    price: 4350000,
    numberStd: 432,
  },
  {
    id: "c5",
    image: telbotImage,
    title: "آموزش ساخت ربات تلگرام با PHP",
    desc: "توی دوره فوق‌العاده جذاب و کاربردی ساخت ربات تلگرام با php، به دنیای عجیب و جذاب ربات نویسی به طرز کاملا متفاوتی وارد میشین؛ این دوره با ارائه سرفصل‌های جذاب و پروژه‌های عملی، منتظر شماست!",
    teacher: "معین باغشیخی ",
    rate: 4.5,
    price: 670000,
    numberStd: 470,
  },
  {
    id: "c6",
    image: algoImage,
    title: "آموزش الگوریتم و ساختمان داده به زبان ساده",
    desc: "الگوریتم، یک مهارت ضروری برای ورود به دنیای برنامه نویسیه که دیدگاه شما رو به مسائل مختلف عوض میکنه. این مهارت، قدرت حل مسئله اتون رو بالا میره و میتونید کدهای بهینه تری بنویسید. تو این دوره، ما الگوریتم رو به زبان ساده، مصور و کاربردی ",
    teacher: "رضا دولتی",
    rate: 5,
    price: 2300000,
    numberStd: 470,
  },
  {
    id: "c7",
    image: graphImage,
    title: "آموزش جامع پروژه محور GraphQL",
    desc: "واسه حرفه‌ای‌تر شدن و استخدام تو شرکت های بزرگ با حقوق های بالا باید Graph رو بلد باشی. تو دوره آموزش graphql به صورت جامع و پروژه محور یاد می‌گیری چطور یه Api گراف بنویسی و باهاش کار کنی",
    teacher: "محمدامین سعیدی راد",
    rate: 4.3,
    price: 970000,
    numberStd: 470,
  },
  {
    id: "c8",
    image: dockerImage,
    title: "آموزش Docker از صفر مطلق!",
    desc: "داکر یک پلتفرم متن باز برای طراحی؛ انتقال؛ استقرار و اجرای نرم افزار ها تحت مفهومی به نام Container می‌باشد، در این دوره به صورت تخصصی مفاهیم و مباحث داکر را فرا خواهیم گرفت.",
    teacher: "آرمین هوشمند",
    rate: 5,
    price: 1499000,
    numberStd: 470,
  },
];

export default DummyCourses;
